In [10]:
import pandas as pd
df1 = pd.read_csv("download-2.csv")

In [11]:
df1.head()

,Age,Gender,Engineer,MBA,Work Exp,Salary,Distance,license,Opt_service
0,28,Male,1,0,5,14.4,5.1,0,0
1,24,Male,1,0,6,10.6,6.1,0,0
2,27,Female,1,0,9,15.5,6.1,0,0
3,25,Male,0,0,1,7.6,6.3,0,0
4,25,Female,0,0,3,9.6,6.7,0,0

In [12]:
df1.corr()

,Age,Engineer,MBA,Work Exp,Salary,Distance,license,Opt_service
Age,1.000000,0.082666,-0.001980,0.924430,0.857784,0.377019,0.391177,0.683498
Engineer,0.082666,1.000000,0.067597,0.079911,0.079428,0.060616,0.008227,0.075514
MBA,-0.001980,0.067597,1.000000,0.039443,0.028627,0.051624,0.007739,-0.002494
Work Exp,0.924430,0.079911,0.039443,1.000000,0.931810,0.395161,0.389882,0.731563
Salary,0.857784,0.079428,0.028627,0.931810,1.000000,0.475367,0.457207,0.810703
Distance,0.377019,0.060616,0.051624,0.395161,0.475367,1.000000,0.309882,0.548475
license,0.391177,0.008227,0.007739,0.389882,0.457207,0.309882,1.000000,0.487126
Opt_service,0.683498,0.075514,-0.002494,0.731563,0.810703,0.548475,0.487126,1.000000

In [14]:
df1.Gender.replace(to_replace=['Male', 'Female'], value=[0, 1],inplace=True)

In [16]:
df1.columns

Index(['Age', 'Gender', 'Engineer', 'MBA', 'Work Exp', 'Salary', 'Distance',
       'license', 'Opt_service'],
      dtype='object')

In [18]:
X = df1[['Age', 'Gender', 'Engineer', 'MBA', 'Work Exp', 'Salary', 'Distance',
       'license']]
#X = df1.drop(['booking_status'],axis=1)
# the dependent variable
y = df1[['Opt_service']]

In [19]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(
 X, y, test_size=0.33, random_state=42)

In [28]:
y_test['Opt_service'].value_counts()

0    127
1     11
Name: Opt_service, dtype: int64